app/Http/Controllers/AuthController.php

insert into `users` (`name`, `email`, `password`, `updated_at`, `created_at`) values ('ofelya galoyan', 'of4ok@mail.ru', '$2y$12$gVUCDDO2l2MEtRRMbpG8yemrAjEip3A9qz0jyxJMXt1kAvQHwj1XW', '2024-04-09 22:18:39', '2024-04-09 22:18:39')
---
    public function store(SignUpFormRequest $request): RedirectResponse
    {
        $user = User::query()->create([
            'name' => $request->get('name'),
            'email' => $request->get('email'),
            'password' => bcrypt($request->get('password')),
        ]);

update `users` set `password` = '$2y$12$nRRrTQI2It6/OVdX14S6a.QdPVfCR7I/4RCeoeETfZmSD5tLp9CwO', `remember_token` = 'efXr0j5ziZcwloMXbMyLXHDjE1gYNLnmKblHEhU79m4JkAKhVCL2vQ3g0NHn', `users`.`updated_at` = '2024-04-01 16:24:20' where `id` = 1
---
            function (User $user, string $password) {
                $user->forceFill([
                    'password' => bcrypt($password)
                ])->setRememberToken(str()->random(60));

                $user->save();