app/Http/Controllers/CatalogController.php

select `id`, `title` from `brands` where exists (select * from `products` where `brands`.`id` = `products`.`brand_id`)
select `id`, `title`, `slug` from `categories` where exists (select * from `products` inner join `category_product` on `products`.`id` = `category_product`.`product_id` where `categories`.`id` = `category_product`.`category_id`)
select `id`, `title`, `slug`, `price`, `thumbnail` from `products` where match (`title`, `text`) against ('Corrupti fuga' in natural language mode) limit 6 offset 0
select count(*) as aggregate from `products` where match (`title`, `text`) against ('Corrupti fuga' in natural language mode)
---
    public function __invoke(?Category $category)
    {
        $brands = Brand::query()
            ->select(['id', 'title'])
            ->has('products')
            ->get();
        $categories = Category::query()
            ->select(['id', 'title', 'slug'])
            ->has('products')
            ->get();
        $products = Product::query()
            ->select(['id', 'title', 'slug', 'price', 'thumbnail'])
            ->when(request('s'), function (Builder $query) {
                $query->whereFullText(['title', 'text'], request('s'));
            })
            ->when($category->exists, function (Builder $query) use ($category) {
                $query->whereRelation(
                    'categories',
                    'categories.id',
                    '=',
                    $category->id
                );
            })
            ->filtered()
            ->sorted()
            ->paginate(6);